# IndexStreamTriangle Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexStreamTriangle Properties
IndexStreamTriangle Class See Also
---
The IndexStreamTriangle type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from IndexStream.) |

# See Also
IndexStreamTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace